name = input('你叫什么 ')
mtp = input('马妈要没收的东西 ')
mtp_1 = input('要没收的东西有什么分支事物 ')
mtp_2 = input('你会为这个分支事物做出什么事情（举例：没收的东西>手机 分支事物>群聊 做出的事情>聊天）')
thi = input('马妈针对你的行为猜疑了什么事物 ')
lhtd = input('马妈在没收你先决条件之后她会让你把心思放在什么东西上 ')
mfymom_worry_about_what = input('马妈担心这个事物会对什么造成影响？ ')

word = name+'，你一直都在这个'+mtp_1+mtp_2+'吗？'+name+'怎么会做出这种事呢，真是让我伤心，都是受了'+thi+'的影响吧？'+name+'不是吗？对不起…我总是跟你唠叨那么多，你想做的事我也不让你做。我真是一个严厉的人啊……但是…这都是为了'+name+'好哦，为了让'+name+'拥有幸福的未来……所以'+mtp+'还是先交给妈妈吧，这几天就先把心思放在'+lhtd+'上吧，这个'+mtp_1+'和'+mfymom_worry_about_what+'没有关系吧，妈妈是因为爱你才会这样做的哦。'

print(word)